Repository: pyschool/pyschool.github.io
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: es

source: [English]
es: Inglés

source: [Spanish]
es: [Español]

source: Stories to learn Python stuff.
es: Talleres para aprender Python.

source: Inspired by %(nodeschool_link)s
es: Inspirado por %(nodeschool_link)s

source: Sample story (fork or copy to create your own story).
es: Taller de muestra (forkear o copiar para crear uno propio).

source: A Pyschool story for learning python essentials.
es: Una historia de Pyschool para aprender los conceptos esenciales de Python.

source: Workshop for learning regular expressions using the commandline.
es: Taller para aprender expresiones regulares usando la línea de comando. Disponible en Inglés solamente

source: Organize
es: Organiza

source: Education is for improving the lives of others and for leaving your community and world better than you found it
es: La educación es para mejorar las vidas de otros y para dejar tu comunidad en un mejor estado de la que la encontraste

source: PySchool is a fully community driven effort and is 100% open source. This means that anyone can use the PySchool materials and/or host an event. There's a lot of flexibility in the specifics of running a PySchool event. The only expectations for event hosts is that events be not-for-profit (free or low cost) and that governance of events should have an open membership model.
es: Pyschool es un efuerzo totalmente llevado a cabo por la comunidad y es 100% open source. Esto quiere decir que cuaquier persona puede usar material de Pyschool, u organizar un evento. Esto da un montón de flexibilidad a la hora de ser anfritrión un evento de Pyschool. La único que se espera de los anfitriones es que los eventos no sean con fines de lucro, y que el modelo de membrecía para participar en ellos sea abierto.

source: To ask and answer questions about authoring Pyschool content, check out our %(pyschool_link)s discussion group. Don't hesitate to send us an %(email_link)s if you can't find the answer you're looking for.
es: Para preguntar y contestar preguntas acerca de la autoría de contenido para Pyschool, visita nuestro grupo de discusión de %(pyschool_link)s. No dudes en mandar un %(email_link)s si no encuentras la respuesta para lo que buscas.

source: Contribute
es: Contribuye

source: The only way to learn a new programming language is by writing programs in it.
es: La única forma de aprender un nuevo lenguaje de programación esescribiendo programas en él.

source: Get Started!
es: ¡Comienza!

source: Ready to write your story? Here's how to set up a story for local development. All stories derive from the base %(story_link)s library.
es: ¿Estás pronto para escribir tu taller? Aquí se muestra como configurar un ambiente local de desarrollo. Todos los talleres derivan de la biblioteca %(story_link)s.

source: Fork/clone/copy the %(hipyschool_link)s or the %(hipy101_link)s repo on Github. Those a good examples of simple stories to begin with.
es: Forkea, clona o copia los repositores de %(hipyschool_link)s o %(hipy101_link)s. Son dos buenos ejemplos de talleres para comenzar.

source: Install your local copy into a virtualenv. Assuming you have virtualenvwrapper installed, this is how you could set up your copy for local development:
es: Enlaza tu copia local a un <code>virtualenv</code>. Asumiendo que tienes virtualenvwrapper instalaldo, puedes inicializar tu copia local para desarrollo de la siguiente manera:

source: Create a module for your <em>Story</em>. For example <code>mystory/__init__.py</code>.
es: Crea un módulo para tu clase <em>Story</em>. Por ejemplo <code>mystory/__init__.py</code>.

source: Define the <code>name</code>, <code>title</code> and <code>adventures</code> variables.
es: Define los atributos <code>name</code>, <code>title</code> and <code>adventures</code>.

source: You will have to use the <code>gettext()</code> function from <code>story.translation</code> to receive translations. More on that below.
es: Deberás usar la función <code>gettext()</code> del módulo <code>story.translation</code> para recibir traducciones. Más abajo se tratará con detenimiento.

source: Create one or more <em>Adventures</em>. A story is a collection of one or more adventures
es: Crea una o más <em>Aventuras</em>. Un taller es una colección de una o más aventuras

source: Create a module for your adventure for example <code>mystory/myfirstadventure</code>
es: Crea un módulo con tu aventura. Por ejemplo <code>mystory/myfirstadventure</code>

source: Create the <code>README.rst</code> file describing your adventure in the previous folder
es: Crea el archivo <code>README.rst</code> conteniendo tu aventura

source: (Optional) Make an Spanish translation. You must name it <code>README.es.rst</code>
es: Haz una traducción a español. Debes de llamarla <code>README.es.rst</code>

source: In the <code>__init__.py</code> file define a class called <code>Adventure</code>, that derives from %(baseadventure_link)s.
es: Define una clase llamada <code>Adventure</code> e

source: Since the <code>gettext()</code> function relies on %(pybabel_link)s, so you will have to initialize the translation by running:
es: Debido a que la función <code>gettext()</code> depende de %(pybabel_link)s, por lo tanto debes inicializar las traducciones ejecutando:

source: You should see several files for each language in <code>mystory/locale/</code> corresponding for the usages of the <code>gettext()</code> function.
es: Deberías ver varios archivos en la carpeta <code>mystory/locale/</code>, correspondientes a los usos de la función <code>gettext()</code>

source: If the command fail, try again.
es: Si el comando falla, intenta nuevamente.

source: (Optional) Modify and add translations in the locale files and then run:
es: (Opcional) Modifica y agrega traducciones in los archivos de la carpeta <code>locale</code>, y luego ejecuta.

source: It is recommended to create some unit tests for checking your solutions, check that your changes pass flake8, tox, and the unit tests:
es: Es recomendado crear algunos test unitarios para verificar tus soluciones, verifica que tus cambios pasen flak8, tox, así como los tests unitarios:

source: To get flake8 and tox, just pip install them into your virtualenv.
es: Para obtener flake8 y tox, solo corre <code>pip install </code> en tu virtualenv.

source: Commit your changes and push your branch to GitHub:
es: Comitea tus cambios y haz un push de tu branch a GitHub:

source: %(publish_link_prefix)s Publish</a> your package in pip, so it is available publicly
es: %(publish_link_prefix)s Publica</a> tu paquete en pip, para que esté disponible públicamente.

source: %(letusknow_link_prefix)s Let us know</a> or submit a pull request to the Pyschool GitHub website to update our website to include your story.
es: %(letusknow_link_prefix)s Háznos saber</a> or haz un pull request al sitio de Pyschool en GitHub.
